import { useContext, useEffect, useReducer, useState } from "react";

const news = [
    {
        id: 0,
        imgUrl: "https://hindi.cdn.zeenews.com/hindi/sites/default/files/2022/11/17/1430152-solar.jpg",
        title: "Jupiter पर इस वजह से बढ़ रही है गर्मी, वैज्ञानिकों ने किया ये बड़ा खुलासा",
        content: "Heat Waves and AURORAS: वैज्ञानिकों ने आखिरकार बृहस्पति ग्रह के सबसे बड़े रहस्यों में से एक का पर्दाफाश कर दिया है. उनके अनुसार,  सौर तूफान बृहस्पति पर रहस्यमय गर्मी और AURORAS पैदा कर रहे हैं. लूनर टोही ऑर्बिटर द्वारा खोजे गए चंद्र गड्ढों में हल्का तापमान होता है, जो चंद्रमा की सतह पर चरम स्थितियों से काफी अलग होता है",
        categoryId: 3
    },
    {
        id: 1,
        imgUrl: "https://hindi.cdn.zeenews.com/hindi/sites/default/files/2022/11/17/1428221-breaking-news-1123.jpg",
        title: "Live Breaking News: कोलकाता में एक अस्पताल में लगी आग, दमकल की 9 गाड़ियां मौके पर",
        content: "कोलकाता के सरकारी एसएसकेएम अस्पताल के सीटी स्कैन विभाग में भीषण आग लग गई. आग बुझाने के लिए दमकल की नौ गाडिय़ों को लगाया गया. अभी तक किसी के हताहत होने, घायल होने या फंसे होने की सूचना नहीं है.",
        categoryId: 3
    },
    {
        id: 2,
        imgUrl: "https://hindi.cdn.zeenews.com/hindi/sites/default/files/2022/11/17/1429922-nasa.jpg",
        title: " धरती से 58 हजार मील दूर से कैसी दिखती है पृथ्वी? ",
        content: "NASA Latest Mission Moon: अमेरिका के फ्लोरिडा में कैनेडी स्पेस सेंटर से16 नवंबर को लॉन्च हुए चंद्रमा मिशन आर्टेमिस-1 (Artemis 1) ने शानदार तस्वीरें भेजनी शुरू कर दी हैं. इस मिशन की लॉन्चिंग के दौरान नासा को कई तरह की समस्याओ का सामना करना पड़ा था. आर्टेमिस-1 (Artemis 1) भेजी गई पृथ्वी की यह तस्वीर धरती से 58,000 मील दूर से खींची गई है. इस फोटो को खींचने के लिए ओरियन ने विशेष कैमरों का उपयोग किया है.",
        categoryId: 3
    },
    {
        id: 3,
        imgUrl: "https://english.cdn.zeenews.com/sites/default/files/styles/zm_700x400/public/2022/11/17/1118425-jeep-grand-cherokee-front.jpg",
        title: "CNG Cars: इन 5 CNG कारों में मिलता है ज्यादा बूट स्पेस, लंबी ट्रिप भी होगी सामान",
        content: "Top-5 CNG Cars With Large Boot Space: पेट्रोल-डीजल कापी महंगा हो चुका है, जिसकी वजह से बड़ी संख्या में लोग अब सीएनजी कारों को खरीदना पसंद कर रहे हैं. लेकिन, बहुत से लोगों को सीएनजी सिलेंडर के कारण बूट स्पेस कम हो जाने की शिकायत रहती है. इसीलिए, आज हम",
        categoryId: 3
    },
    {
        id: 4,
        imgUrl: "https://english.cdn.zeenews.com/sites/default/files/styles/zm_700x400/public/2022/11/17/1118277-elle-awards-2022.jpg",
        title: "दिल्ली एमसीडी चुनाव के लिए कांग्रेस ने अपने स्टार प्रचारकों की सूची जारी की",
        content: "दिल्ली नगर निगम (एमसीडी) के आगामी चुनावों में अपनी छाप छोड़ने के प्रयास में, कांग्रेस ने अपने स्टार प्रचारकों के रूप में सचिन पायलट, कन्हैया कुमार और सलमान खुर्शीद सहित विभिन्न राज्यों के अपने लोकप्रिय नेताओं को शामिल किया है। पार्टी के स्टार प्रचारकों की सूची में उत्तर प्रदेश की विधायक आराधना मिश्रा,",
        categoryId: 8
    },
    {
        id: 5,
        imgUrl: "https://english.cdn.zeenews.com/sites/default/files/styles/zm_700x400/public/2022/11/17/1118396-tara-sutaria-black-hot-main.gif",
        title: "आप ने एमसीडी चुनाव के लिए 117 उम्मीदवारों की दूसरी सूची जारी की",
        content: "आम आदमी पार्टी (आप) ने चार दिसंबर को होने वाले दिल्ली नगर निगम (एमसीडी) चुनाव के लिए शनिवार को 117 उम्मीदवारों की दूसरी सूची जारी की। पार्टी ने 250 वार्ड के चुनाव के लिए शुक्रवार को 134 उम्मीदवारों की अपनी पहली सूची जारी की थी। पार्टी ने एक बयान में कहा, ‘‘लोगों की पसंद पार्टी की आवाज बन गई है’’ और सभी सर्वेक्षणों में शीर्ष पर आने के बाद पुराने पार्टी कार्यकर्ताओं को उम्मीदवारों की दूसरी सूची में वरीयता मिली है।",
        categoryId: 8
    },
   
    
    
]

export default news;


// useReducer
// useContext
// useEffect
// useState